In [1]:
import pandas as pd

In [2]:
import numpy as np

df = pd.DataFrame(
    {'a':[1,2,3],
    'b':[4,5,6],
    'c':[7,8,9]})

In [3]:
df[df>7]

    a   b    c
0 NaN NaN  NaN
1 NaN NaN  8.0
2 NaN NaN  9.0

In [4]:
df.b > 7

0    False
1    False
2    False
Name: b, dtype: bool

In [5]:
df[df.b > 7]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [8]:
df[df.b > 5]

   a  b  c
2  3  6  9

- drop_duplicates() : 중복된 값 삭제

In [27]:
df = pd.DataFrame(
    {'a':[1,1,1],
    'b':[1,1,1],
    'c':[1,2,9]})

In [28]:
df.drop_duplicates()

   a  b  c
0  1  1  1
1  1  1  2
2  1  1  9

In [29]:
df.drop_duplicates(inplace=True)
df

   a  b  c
0  1  1  1
1  1  1  2
2  1  1  9